app/Http/Controllers/CommentController.php

insert into `comments` (`content`, `user_id`, `monster_id`, `updated_at`, `created_at`) values ('Le plus bel homme de la terre !', 11, 54, '2024-01-23 08:05:19', '2024-01-23 08:05:19')
---
    public function store(Request $request, Monster $monster)
    {
        $request->validate([
            'content' => 'required|string',
        ]);

        $comment = new Comment();
        $comment->content = $request->input('content');
        $comment->user_id = auth()->id();
        $comment->monster_id = $monster->id;

        $comment->save();