app/Http/Controllers/MonsterController.php

select exists(select * from `favorites` where `user_id` = 11 and `monster_id` = '55') as `exists`
insert into `favorites` (`user_id`, `monster_id`, `updated_at`, `created_at`) values (11, '55', '2024-01-23 08:18:19', '2024-01-23 08:18:19')
---
    public function addToFavorites($monsterId)
    {
        $user = auth()->user();
        $favorite = Favorite::where('user_id', $user->id)->where('monster_id', $monsterId);
        if ($favorite->exists()) {
            $favorite->delete();
        } else {
            Favorite::create(['user_id' => $user->id, 'monster_id' => $monsterId]);

select distinct `rarety_id` from `monsters`
select `name`, `id` from `rareties` where `id` in (1, 2, 4, 5, 6, 7, 8)
---
    public function create()
    {
        $types = Type::all();
        $rarityIds = Monster::distinct('rarety_id')->pluck('rarety_id');
        $rarities = Rarety::whereIn('id', $rarityIds)->pluck('name', 'id');

insert into `monsters` (`name`, `user_id`, `type_id`, `rarety_id`, `pv`, `attack`, `defense`, `description`, `image_url`, `updated_at`, `created_at`) values ('dazefhiogeizojapkdivbezjkniap', 11, '1', '1', '1', '1', '1', '^l$o)iàupygfdtrsetdycfuvgbhonjp,k', '1705999668.jpg', '2024-01-23 08:47:48', '2024-01-23 08:47:48')
---
    public function store(Request $request)
    {

        $monster = new Monster();
        $monster->name = $request->input('name');
        $monster->user_id = auth()->user()->id;
        $monster->type_id = $request->input('type');
        $monster->rarety_id = $request->input('rarety');
        $monster->pv = $request->input('pv');
        $monster->attack = $request->input('attack');
        $monster->defense = $request->input('defense');
        $monster->description = $request->input('description');
        if ($request->hasFile('image')) {
            $imageName = time() . '.' . $request->image->extension();
            $request->image->move(public_path('images'), $imageName);
            $monster->image_url = $imageName;
        }


        $monster->save();

select distinct `rarety_id` from `monsters`
select `name`, `id` from `rareties` where `id` in (1, 2, 4, 5, 6, 7, 8)
---
    public function edit(Monster $monster)
    {
        $this->authorize('update', $monster);

        $user = Auth::user();
        $types = Type::all();
        $rarityIds = Monster::distinct('rarety_id')->pluck('rarety_id');
        $rarities = Rarety::whereIn('id', $rarityIds)->pluck('name', 'id');

select * from `monsters` where `monsters`.`id` = '53' limit 1
delete from `monsters` where `id` = 50
---
    public function updateMonster(Request $request, $monster)
    {

        $monster = Monster::findOrFail($monster);

        $monster->name = $request->input('name');
        $monster->type_id = $request->input('type');
        $monster->rarety_id = $request->input('rarety');
        $monster->pv = $request->input('pv');
        $monster->attack = $request->input('attack');
        $monster->defense = $request->input('defense');
        $monster->description = $request->input('description');

        if ($request->hasFile('image')) {
            if ($monster->image_url) {
                Storage::delete('public/images/' . $monster->image_url);

select * from `comments` where `monster_id` = 55
select * from `notations` where `monster_id` = 55
delete from `notations` where `monster_id` = 55
delete from `monsters` where `id` = 55
---
    public function deleteMonster(Monster $monster)
    {
        $this->authorize('delete', $monster);

        $comments = Comment::where('monster_id', $monster->id)->get();

        foreach ($comments as $comment) {
            $comment->delete();
        }

        $notations = Notation::where('monster_id', $monster->id)->get();

        foreach ($notations as $notation) {
            $notation->delete();
        }

        $favorites = Favorite::where('monster_id', $monster->id)->get();

        foreach ($favorites as $favorite) {
            $favorite->delete();
        }

        $monster->delete();